# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [2]:
# Your code here
cur.execute("""SELECT firstName, lastName 
               FROM employees 
               JOIN offices 
               USING(officeCode) 
               WHERE city = 'Boston'
               ;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [3]:
# Your code here
cur.execute("""SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
               FROM offices AS o 
               LEFT JOIN employees AS e
               USING(officeCode)
               GROUP BY officeCode
               HAVING n_employees = 0
               ;""")
df1 = pd.DataFrame(cur.fetchall())
df1.columns = [x[0] for x in cur.description]
df1

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [7]:
# Your code here
# Display the htmlDescription and employee's first and last name
# for each product that each employee has sold
cur.execute("""SELECT firstName, lastName, htmlDescription
            FROM employees e
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN orders o
            USING(customerNumber)
            JOIN orderdetails od
            USING(orderNumber)
            JOIN products p
            USING(productCode)
            JOIN productlines pl
            USING(productLine)
            ORDER BY lastName
            ;""")
df2 = pd.DataFrame(cur.fetchall())
df2.columns = [x[0] for x in cur.description]
df2

     firstName lastName htmlDescription
0         Loui   Bondur
1         Loui   Bondur
2         Loui   Bondur
3         Loui   Bondur
4         Loui   Bondur
...        ...      ...             ...
2991    George   Vanauf
2992    George   Vanauf
2993    George   Vanauf
2994    George   Vanauf
2995    George   Vanauf

[2996 rows x 3 columns]

In [18]:
# Your code here
# Display the office with the biggest payment from a customer
cur.execute("""SELECT o.officeCode, o.city, o.addressLine1, o.country, o.postalCode 
            FROM offices o
            JOIN employees e
            ON o.officeCode = e.officeCode
            JOIN customers c
            ON e.employeeNumber = c.salesRepEmployeeNumber
            JOIN payments p
            USING(customerNumber)
            ORDER BY amount DESC
            LIMIT 1
            ;""")
df3 = pd.DataFrame(cur.fetchall())
df3.columns = [x[0] for x in cur.description]
df3

   officeCode   city              addressLine1 country postalCode
0           4  Paris  43 Rue Jouffroy D'abbans  France      75017

In [ ]:
# Your code here
# Display the order with the most expensive item (by MSRP)
cur.execute("""SELECT o.orderNumber, od.productCode, p.MSRP
            FROM orders o
            JOIN orderdetails od
            USING(orderNumber)
            JOIN products p
            USING(productCode)
            ORDER BY MSRP DESC
            ;""")
df4 = pd.DataFrame(cur.fetchall())
df4.columns = [x[0] for x in cur.description]
df4

## Level Up: Display the names of every individual product that each employee has sold

In [19]:
# Your code here
cur.execute("""SELECT firstName, lastName, productName
               FROM employees e
               JOIN customers c
               ON e.employeeNumber = c.salesRepEmployeeNumber
               JOIN orders o
               USING(customerNumber)
               JOIN orderdetails od
               USING(orderNumber)
               JOIN products p
               USING(productCode)
               ;""")
df5 = pd.DataFrame(cur.fetchall())
df5.columns = [x[0] for x in cur.description]
df5.head()

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!